moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
/**
 * @file esphome_noise.c
 * @brief ESPHome Noise Protocol Encryption Implementation
 *
 * Implements Noise Protocol (NNpsk0) for ESPHome Native API encryption.
 * Uses mbedtls for cryptographic primitives.
 *
 * @copyright Copyright (c) 2026
 * @license Apache License 2.0
 */

#include "esphome_noise.h"
#include "esphome_common.h"
#include "esphome_crypto_constants.h"
#include "core/memory/memory_manager_ng.h"
#include <string.h>
#include <stdlib.h>
#include "esp_log.h"
#include "esp_random.h"
#include "esp_idf_version.h"

/* ESP-IDF v6.0+ uses PSA Crypto API, v5.x uses legacy mbedTLS API */
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
#include "psa/crypto.h"
#define USE_PSA_CRYPTO 1
#else
#include "mbedtls/sha256.h"
#include "mbedtls/chachapoly.h"
#define USE_PSA_CRYPTO 0
#endif

#include "mbedtls/base64.h"
#include "mbedtls/platform_util.h"

/* Log tag */
static const char *TAG = "ESPHOME_NOISE";

/* ============================================================================
 * X25519 Implementation (TweetNaCl-based)
 * ============================================================================
 * Minimal X25519 implementation for Curve25519 Diffie-Hellman.
 * Based on TweetNaCl for portability.
 * ============================================================================ */

/*
 * X25519 Implementation (canonical TweetNaCl, RFC 7748)
 *
 * This is the portable, audited TweetNaCl implementation of X25519.
 * It uses car25519 for carry reduction which correctly handles negative
 * limbs (adding 1<<16 before shifting ensures non-negative values).
 */

typedef int64_t gf[16];

static const gf GF_121665 = {0xDB41, 1};
static const uint8_t CURVE25519_BASEPOINT[32] = {9};

static void car25519(gf o)
{
    int i;
    int64_t c;
    for (i = 0; i < 16; i++) {
        o[i] += (1LL << 16);
        c = o[i] >> 16;
        o[(i + 1) * (i < 15)] += c - 1 + 37 * (c - 1) * (i == 15);
        o[i] -= c << 16;
    }
}

static void sel25519(gf p, gf q, int b)
{
    int64_t t, i, c = ~(b - 1);
    for (i = 0; i < 16; i++) {
        t = c & (p[i] ^ q[i]);
        p[i] ^= t;
        q[i] ^= t;
    }
}

static void pack25519(uint8_t *o, const gf n)
{
    int i, j, b;
    gf m, t;
    for (i = 0; i < 16; i++) t[i] = n[i];
    car25519(t);
    car25519(t);
    car25519(t);
    for (j = 0; j < 2; j++) {
        m[0] = t[0] - 0xFFED;
        for (i = 1; i < 15; i++) {
            m[i] = t[i] - 0xFFFF - ((m[i - 1] >> 16) & 1);
            m[i - 1] &= 0xFFFF;
        }
        m[15] = t[15] - 0x7FFF - ((m[14] >> 16) & 1);
        b = (m[15] >> 16) & 1;
        m[14] &= 0xFFFF;
        sel25519(t, m, 1 - b);
    }
    for (i = 0; i < 16; i++) {
        o[2 * i] = t[i] & 0xFF;
        o[2 * i + 1] = t[i] >> 8;
    }
}

static void unpack25519(gf o, const uint8_t *n)
{
    int i;
    for (i = 0; i < 16; i++) o[i] = n[2 * i] + ((int64_t)n[2 * i + 1] << 8);
    o[15] &= 0x7FFF;
}

static void A(gf o, const gf a, const gf b)
{
    int i;
    for (i = 0; i < 16; i++) o[i] = a[i] + b[i];
}

static void Z(gf o, const gf a, const gf b)
{
    int i;
    for (i = 0; i < 16; i++) o[i] = a[i] - b[i];
}

static void M(gf o, const gf a, const gf b)
{
    int64_t i, j, t[31];
    for (i = 0; i < 31; i++) t[i] = 0;
    for (i = 0; i < 16; i++) {
        for (j = 0; j < 16; j++) {
            t[i + j] += a[i] * b[j];
        }
    }
    for (i = 0; i < 15; i++) t[i] += 38 * t[i + 16];
    for (i = 0; i < 16; i++) o[i] = t[i];
    car25519(o);
    car25519(o);
}

static void S(gf o, const gf a)
{
    M(o, a, a);
}

static void inv25519(gf o, const gf i)
{
    gf c;
    int a;
    for (a = 0; a < 16; a++) c[a] = i[a];
    for (a = 253; a >= 0; a--) {
        S(c, c);
        if (a != 2 && a != 4) M(c, c, i);
    }
    for (a = 0; a < 16; a++) o[a] = c[a];
}

static void scalarmult(uint8_t *q, const uint8_t *n, const uint8_t *p)
{
    uint8_t z[32];
    int64_t x[80], r, i;
    gf a, b, c, d, e, f;

    for (i = 0; i < 31; i++) z[i] = n[i];
    z[31] = (n[31] & 127) | 64;
    z[0] &= 248;

    unpack25519(x, p);
    for (i = 0; i < 16; i++) {
        b[i] = x[i];
        d[i] = a[i] = c[i] = 0;
    }
    a[0] = d[0] = 1;

    for (i = 254; i >= 0; --i) {
        r = (z[i >> 3] >> (i & 7)) & 1;
        sel25519(a, b, r);
        sel25519(c, d, r);
        A(e, a, c);
        Z(a, a, c);
        A(c, b, d);
        Z(b, b, d);
        S(d, e);
        S(f, a);
        M(a, c, a);
        M(c, b, e);
        A(e, a, c);
        Z(a, a, c);
        S(b, a);
        Z(c, d, f);
        M(a, c, GF_121665);
        A(a, a, d);
        M(c, c, a);
        M(a, d, f);
        M(d, b, x);
        S(b, e);
        sel25519(a, b, r);
        sel25519(c, d, r);
    }
    for (i = 0; i < 16; i++) {
        x[i + 16] = a[i];
        x[i + 32] = c[i];
        x[i + 48] = b[i];
        x[i + 64] = d[i];
    }
    inv25519(x + 32, x + 32);
    M(x + 16, x + 16, x + 32);
    pack25519(q, x + 16);
}

/**
 * @brief Generate X25519 keypair
 */
static void x25519_keypair(uint8_t *public_key, uint8_t *private_key)
{
    esp_fill_random(private_key, 32);
    private_key[0] &= 248;
    private_key[31] &= 127;
    private_key[31] |= 64;
    scalarmult(public_key, private_key, CURVE25519_BASEPOINT);
}

/**
 * @brief Compute X25519 shared secret
 */
static void x25519_shared_secret(uint8_t *shared, const uint8_t *private_key,
                                  const uint8_t *public_key)
{
    scalarmult(shared, private_key, public_key);
}

/* ============================================================================
 * HMAC-SHA256 Implementation
 * ============================================================================ */

/**
 * @brief Compute HMAC-SHA256
 */
static void hmac_sha256(const uint8_t *key, size_t key_len,
                        const uint8_t *data, size_t data_len,
                        uint8_t *out)
{
#if USE_PSA_CRYPTO
    /* PSA Crypto API: Use psa_mac_compute for HMAC-SHA256 */
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t key_id = 0;
    size_t out_len = 0;

    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_SIGN_MESSAGE);
    psa_set_key_algorithm(&attributes, PSA_ALG_HMAC(PSA_ALG_SHA_256));
    psa_set_key_type(&attributes, PSA_KEY_TYPE_HMAC);
    psa_set_key_bits(&attributes, key_len * 8);

    psa_status_t status = psa_import_key(&attributes, key, key_len, &key_id);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_import_key for HMAC failed: %d", (int)status);
        memset(out, 0, NOISE_HASH_SIZE);
        return;
    }

    status = psa_mac_compute(key_id, PSA_ALG_HMAC(PSA_ALG_SHA_256),
                              data, data_len,
                              out, NOISE_HASH_SIZE, &out_len);
    psa_destroy_key(key_id);

    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_mac_compute failed: %d", (int)status);
        memset(out, 0, NOISE_HASH_SIZE);
    }
#else
    /* Legacy mbedTLS API */
    uint8_t k_ipad[NOISE_HMAC_BLOCK_SIZE];
    uint8_t k_opad[NOISE_HMAC_BLOCK_SIZE];
    uint8_t k_hash[NOISE_HASH_SIZE];
    mbedtls_sha256_context ctx;

    /* If key is longer than block size, hash it */
    if (key_len > NOISE_HMAC_KEY_MAX_LEN) {
        mbedtls_sha256_init(&ctx);
        mbedtls_sha256_starts(&ctx, 0);
        mbedtls_sha256_update(&ctx, key, key_len);
        mbedtls_sha256_finish(&ctx, k_hash);
        mbedtls_sha256_free(&ctx);
        key = k_hash;
        key_len = NOISE_HASH_SIZE;
    }

    /* Prepare pads */
    memset(k_ipad, 0x36, NOISE_HMAC_BLOCK_SIZE);
    memset(k_opad, 0x5c, NOISE_HMAC_BLOCK_SIZE);
    for (size_t i = 0; i < key_len; i++) {
        k_ipad[i] ^= key[i];
        k_opad[i] ^= key[i];
    }

    /* Inner hash: SHA256(k_ipad || data) */
    uint8_t inner[NOISE_HASH_SIZE];
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);
    mbedtls_sha256_update(&ctx, k_ipad, NOISE_HMAC_BLOCK_SIZE);
    if (data_len > 0 && data != NULL) {
        mbedtls_sha256_update(&ctx, data, data_len);
    }
    mbedtls_sha256_finish(&ctx, inner);
    mbedtls_sha256_free(&ctx);

    /* Outer hash: SHA256(k_opad || inner) */
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);
    mbedtls_sha256_update(&ctx, k_opad, NOISE_HMAC_BLOCK_SIZE);
    mbedtls_sha256_update(&ctx, inner, NOISE_HASH_SIZE);
    mbedtls_sha256_finish(&ctx, out);
    mbedtls_sha256_free(&ctx);

    /* Clear sensitive data */
    mbedtls_platform_zeroize(k_ipad, sizeof(k_ipad));
    mbedtls_platform_zeroize(k_opad, sizeof(k_opad));
    mbedtls_platform_zeroize(inner, sizeof(inner));
#endif
}

/* ============================================================================
 * Noise Protocol Primitives
 * ============================================================================ */

/**
 * @brief SHA256 hash
 */
static void noise_hash(const uint8_t *data, size_t len, uint8_t *out)
{
#if USE_PSA_CRYPTO
    size_t hash_len = 0;
    psa_status_t status = psa_hash_compute(PSA_ALG_SHA_256, data, len,
                                            out, NOISE_HASH_SIZE, &hash_len);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_hash_compute failed: %d", (int)status);
        memset(out, 0, NOISE_HASH_SIZE);
    }
#else
    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);
    mbedtls_sha256_update(&ctx, data, len);
    mbedtls_sha256_finish(&ctx, out);
    mbedtls_sha256_free(&ctx);
#endif
}

/**
 * @brief Noise HKDF function (Section 4.3 of Noise spec)
 *
 * Note: This is NOT RFC 5869 HKDF, but Noise's own variant.
 */
static void noise_hkdf(const uint8_t *ck, const uint8_t *ikm, size_t ikm_len,
                       uint8_t *out1, uint8_t *out2, uint8_t *out3)
{
    /* temp_key = HMAC(ck, ikm) */
    uint8_t temp_key[NOISE_HASH_SIZE];
    hmac_sha256(ck, NOISE_HASH_SIZE, ikm, ikm_len, temp_key);

    /* output1 = HMAC(temp_key, 0x01) */
    uint8_t one = 0x01;
    hmac_sha256(temp_key, NOISE_HASH_SIZE, &one, 1, out1);

