moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
    if (out2) {
        /* output2 = HMAC(temp_key, output1 || 0x02) */
        uint8_t buf[NOISE_HASH_SIZE + 1];
        memcpy(buf, out1, NOISE_HASH_SIZE);
        buf[NOISE_HASH_SIZE] = 0x02;
        hmac_sha256(temp_key, NOISE_HASH_SIZE, buf, NOISE_HASH_SIZE + 1, out2);

        if (out3) {
            /* output3 = HMAC(temp_key, output2 || 0x03) */
            memcpy(buf, out2, NOISE_HASH_SIZE);
            buf[NOISE_HASH_SIZE] = 0x03;
            hmac_sha256(temp_key, NOISE_HASH_SIZE, buf, NOISE_HASH_SIZE + 1, out3);
        }
    }

    mbedtls_platform_zeroize(temp_key, sizeof(temp_key));
}

/**
 * @brief MixKey operation (Section 4.3)
 */
static void noise_mix_key(esphome_noise_ctx_t *ctx, const uint8_t *ikm, size_t ikm_len)
{
    uint8_t temp_k[NOISE_HASH_SIZE];
    noise_hkdf(ctx->ck, ikm, ikm_len, ctx->ck, temp_k, NULL);
    memcpy(ctx->k, temp_k, NOISE_HASH_SIZE);
    ctx->n = 0;
    ctx->has_key = true;
    mbedtls_platform_zeroize(temp_k, sizeof(temp_k));
}

/**
 * @brief MixHash operation
 */
static void noise_mix_hash(esphome_noise_ctx_t *ctx, const uint8_t *data, size_t len)
{
#if USE_PSA_CRYPTO
    psa_hash_operation_t op = PSA_HASH_OPERATION_INIT;
    size_t hash_len = 0;

    psa_status_t status = psa_hash_setup(&op, PSA_ALG_SHA_256);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_hash_setup failed: %d", (int)status);
        return;
    }

    status = psa_hash_update(&op, ctx->h, NOISE_HASH_SIZE);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_hash_update (h) failed: %d", (int)status);
        psa_hash_abort(&op);
        return;
    }

    status = psa_hash_update(&op, data, len);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_hash_update (data) failed: %d", (int)status);
        psa_hash_abort(&op);
        return;
    }

    status = psa_hash_finish(&op, ctx->h, NOISE_HASH_SIZE, &hash_len);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_hash_finish failed: %d", (int)status);
    }
#else
    mbedtls_sha256_context sha_ctx;
    mbedtls_sha256_init(&sha_ctx);
    mbedtls_sha256_starts(&sha_ctx, 0);
    mbedtls_sha256_update(&sha_ctx, ctx->h, NOISE_HASH_SIZE);
    mbedtls_sha256_update(&sha_ctx, data, len);
    mbedtls_sha256_finish(&sha_ctx, ctx->h);
    mbedtls_sha256_free(&sha_ctx);
#endif
}

/**
 * @brief MixKeyAndHash operation for PSK
 */
static void noise_mix_key_and_hash(esphome_noise_ctx_t *ctx, const uint8_t *ikm, size_t ikm_len)
{
    uint8_t temp_h[NOISE_HASH_SIZE], temp_k[NOISE_HASH_SIZE];
    noise_hkdf(ctx->ck, ikm, ikm_len, ctx->ck, temp_h, temp_k);
    noise_mix_hash(ctx, temp_h, NOISE_HASH_SIZE);
    memcpy(ctx->k, temp_k, NOISE_HASH_SIZE);
    ctx->n = 0;
    ctx->has_key = true;
    mbedtls_platform_zeroize(temp_h, sizeof(temp_h));
    mbedtls_platform_zeroize(temp_k, sizeof(temp_k));
}

/**
 * @brief Build nonce for ChaCha20-Poly1305
 *
 * Format: [4 zero bytes][8-byte counter, little-endian]
 */
static void noise_build_nonce(uint64_t n, uint8_t *nonce)
{
    memset(nonce, 0, 4);
    for (int i = 0; i < 8; i++) {
        nonce[4 + i] = (n >> (i * 8)) & 0xff;
    }
}

/**
 * @brief Encrypt with AEAD (ChaCha20-Poly1305)
 */
static esp_err_t noise_encrypt_aead(const uint8_t *key, uint64_t nonce,
                                     const uint8_t *ad, size_t ad_len,
                                     const uint8_t *plaintext, size_t plaintext_len,
                                     uint8_t *ciphertext, uint8_t *tag)
{
    uint8_t nonce_bytes[12];
    noise_build_nonce(nonce, nonce_bytes);

#if USE_PSA_CRYPTO
    psa_status_t status;
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t key_id = 0;
    size_t output_len = 0;

    /* Ensure PSA Crypto is initialized (idempotent) */
    status = psa_crypto_init();
    if (status != PSA_SUCCESS && status != PSA_ERROR_ALREADY_EXISTS &&
        status != PSA_ERROR_BAD_STATE) {
        ESP_LOGE(TAG, "psa_crypto_init failed in encrypt: %d", (int)status);
        return ESP_FAIL;
    }

    /* Debug: verify key is valid */
    if (key == NULL) {
        ESP_LOGE(TAG, "Encrypt key is NULL");
        return ESP_ERR_INVALID_ARG;
    }

    /* Import ChaCha20-Poly1305 key */
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_ENCRYPT);
    psa_set_key_algorithm(&attributes, PSA_ALG_CHACHA20_POLY1305);
    psa_set_key_type(&attributes, PSA_KEY_TYPE_CHACHA20);
    psa_set_key_bits(&attributes, 256);

    status = psa_import_key(&attributes, key, 32, &key_id);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_import_key for encrypt failed: %d (key_type=0x%04x, bits=%d)",
                 (int)status, PSA_KEY_TYPE_CHACHA20, 256);
        return ESP_FAIL;
    }

    /* PSA AEAD outputs ciphertext || tag concatenated */
    uint8_t *output = mem_alloc(plaintext_len + 16, MEM_CAP_DEFAULT);
    if (output == NULL) {
        psa_destroy_key(key_id);
        ESP_LOGE(TAG, "Failed to allocate AEAD output buffer");
        return ESP_ERR_NO_MEM;
    }

    status = psa_aead_encrypt(key_id, PSA_ALG_CHACHA20_POLY1305,
                               nonce_bytes, 12,
                               ad, ad_len,
                               plaintext, plaintext_len,
                               output, plaintext_len + 16, &output_len);
    psa_destroy_key(key_id);

    if (status != PSA_SUCCESS) {
        mem_ng_free(output);
        ESP_LOGE(TAG, "psa_aead_encrypt failed: %d", (int)status);
        return ESP_FAIL;
    }

    /* Split output into ciphertext and tag */
    memcpy(ciphertext, output, plaintext_len);
    memcpy(tag, output + plaintext_len, 16);
    mem_ng_free(output);

    return ESP_OK;
#else
    mbedtls_chachapoly_context ctx;
    mbedtls_chachapoly_init(&ctx);

    int ret = mbedtls_chachapoly_setkey(&ctx, key);
    if (ret != 0) {
        mbedtls_chachapoly_free(&ctx);
        ESP_LOGE(TAG, "ChaCha20-Poly1305 setkey failed: %d", ret);
        return ESP_FAIL;
    }

    ret = mbedtls_chachapoly_encrypt_and_tag(&ctx, plaintext_len,
                                               nonce_bytes,
                                               ad, ad_len,
                                               plaintext,
                                               ciphertext,
                                               tag);
    mbedtls_chachapoly_free(&ctx);

    if (ret != 0) {
        ESP_LOGE(TAG, "ChaCha20-Poly1305 encrypt failed: %d", ret);
        return ESP_FAIL;
    }

    return ESP_OK;
#endif
}

/**
 * @brief Decrypt with AEAD (ChaCha20-Poly1305)
 */
static esp_err_t noise_decrypt_aead(const uint8_t *key, uint64_t nonce,
                                     const uint8_t *ad, size_t ad_len,
                                     const uint8_t *ciphertext, size_t ciphertext_len,
                                     const uint8_t *tag,
                                     uint8_t *plaintext)
{
    uint8_t nonce_bytes[12];
    noise_build_nonce(nonce, nonce_bytes);

#if USE_PSA_CRYPTO
    psa_status_t status;
    psa_key_attributes_t attributes = PSA_KEY_ATTRIBUTES_INIT;
    psa_key_id_t key_id = 0;
    size_t output_len = 0;

    /* Ensure PSA Crypto is initialized (idempotent) */
    status = psa_crypto_init();
    if (status != PSA_SUCCESS && status != PSA_ERROR_ALREADY_EXISTS &&
        status != PSA_ERROR_BAD_STATE) {
        ESP_LOGE(TAG, "psa_crypto_init failed in decrypt: %d", (int)status);
        return ESP_FAIL;
    }

    /* Debug: verify key is valid */
    if (key == NULL) {
        ESP_LOGE(TAG, "Decrypt key is NULL");
        return ESP_ERR_INVALID_ARG;
    }

    /* Import ChaCha20-Poly1305 key */
    psa_set_key_usage_flags(&attributes, PSA_KEY_USAGE_DECRYPT);
    psa_set_key_algorithm(&attributes, PSA_ALG_CHACHA20_POLY1305);
    psa_set_key_type(&attributes, PSA_KEY_TYPE_CHACHA20);
    psa_set_key_bits(&attributes, 256);

