moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
    /* Deliberately no logging of key bytes here.
     *
     * This used to log the first four bytes of the session key at DEBUG level
     * as an import sanity check. mqtt_logger.c installs itself with
     * esp_log_set_vprintf(), so every log line — including that one — is
     * eligible to be published to the broker once log forwarding is on. Key
     * material must not be reachable that way, and a partial key tells a
     * debugging session nothing that the PSA status code does not. */
    status = psa_import_key(&attributes, key, 32, &key_id);
    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_import_key for decrypt failed: %d (key_type=0x%04x, bits=%d)",
                 (int)status, PSA_KEY_TYPE_CHACHA20, 256);
        return ESP_FAIL;
    }

    /* PSA AEAD expects ciphertext || tag concatenated as input */
    uint8_t *input = mem_alloc(ciphertext_len + 16, MEM_CAP_DEFAULT);
    if (input == NULL) {
        psa_destroy_key(key_id);
        ESP_LOGE(TAG, "Failed to allocate AEAD input buffer");
        return ESP_ERR_NO_MEM;
    }

    memcpy(input, ciphertext, ciphertext_len);
    memcpy(input + ciphertext_len, tag, 16);

    status = psa_aead_decrypt(key_id, PSA_ALG_CHACHA20_POLY1305,
                               nonce_bytes, 12,
                               ad, ad_len,
                               input, ciphertext_len + 16,
                               plaintext, ciphertext_len, &output_len);
    psa_destroy_key(key_id);
    mem_ng_free(input);

    if (status != PSA_SUCCESS) {
        ESP_LOGE(TAG, "psa_aead_decrypt failed: %d", (int)status);
        return ESP_ERR_INVALID_CRC;  /* MAC verification failed */
    }

    return ESP_OK;
#else
    mbedtls_chachapoly_context ctx;
    mbedtls_chachapoly_init(&ctx);

    int ret = mbedtls_chachapoly_setkey(&ctx, key);
    if (ret != 0) {
        mbedtls_chachapoly_free(&ctx);
        ESP_LOGE(TAG, "ChaCha20-Poly1305 setkey failed: %d", ret);
        return ESP_FAIL;
    }

    ret = mbedtls_chachapoly_auth_decrypt(&ctx, ciphertext_len,
                                            nonce_bytes,
                                            ad, ad_len,
                                            tag,
                                            ciphertext,
                                            plaintext);
    mbedtls_chachapoly_free(&ctx);

    if (ret != 0) {
        ESP_LOGE(TAG, "ChaCha20-Poly1305 decrypt/verify failed: %d", ret);
        return ESP_ERR_INVALID_CRC;  /* MAC verification failed */
    }

    return ESP_OK;
#endif
}

/**
 * @brief EncryptAndHash operation
 */
static esp_err_t noise_encrypt_and_hash(esphome_noise_ctx_t *ctx,
                                         const uint8_t *plaintext, size_t plaintext_len,
                                         uint8_t *ciphertext)
{
    if (!ctx->has_key) {
        /* No key yet, just copy plaintext */
        if (plaintext_len > 0 && plaintext != NULL) {
            memcpy(ciphertext, plaintext, plaintext_len);
        }
        noise_mix_hash(ctx, ciphertext, plaintext_len);
        return ESP_OK;
    }

    uint8_t tag[ESPHOME_NOISE_MAC_SIZE];
    /* Use empty buffer for NULL plaintext (for empty payload encryption) */
    static const uint8_t empty_buf[1] = {0};
    const uint8_t *pt = (plaintext != NULL) ? plaintext : empty_buf;

    esp_err_t ret = noise_encrypt_aead(ctx->k, ctx->n, ctx->h, NOISE_HASH_SIZE,
                                        pt, plaintext_len,
                                        ciphertext, tag);
    if (ret != ESP_OK) {
        return ret;
    }

    /* Append tag after ciphertext */
    memcpy(ciphertext + plaintext_len, tag, ESPHOME_NOISE_MAC_SIZE);
    noise_mix_hash(ctx, ciphertext, plaintext_len + ESPHOME_NOISE_MAC_SIZE);
    ctx->n++;

    return ESP_OK;
}

/**
 * @brief DecryptAndHash operation
 */
static esp_err_t noise_decrypt_and_hash(esphome_noise_ctx_t *ctx,
                                         const uint8_t *ciphertext, size_t ciphertext_len,
                                         uint8_t *plaintext, size_t *plaintext_len)
{
    if (!ctx->has_key) {
        /* No key yet, just copy ciphertext */
        memcpy(plaintext, ciphertext, ciphertext_len);
        *plaintext_len = ciphertext_len;
        noise_mix_hash(ctx, ciphertext, ciphertext_len);
        return ESP_OK;
    }

    if (ciphertext_len < ESPHOME_NOISE_MAC_SIZE) {
        ESP_LOGE(TAG, "Ciphertext too short for MAC");
        return ESP_ERR_INVALID_SIZE;
    }

    size_t data_len = ciphertext_len - ESPHOME_NOISE_MAC_SIZE;
    const uint8_t *tag = ciphertext + data_len;

    esp_err_t ret = noise_decrypt_aead(ctx->k, ctx->n, ctx->h, NOISE_HASH_SIZE,
                                        ciphertext, data_len,
                                        tag, plaintext);
    if (ret != ESP_OK) {
        return ret;
    }

    noise_mix_hash(ctx, ciphertext, ciphertext_len);
    *plaintext_len = data_len;
    ctx->n++;

    return ESP_OK;
}

/**
 * @brief Split operation - derive transport keys
 */
static void noise_split(esphome_noise_ctx_t *ctx)
{
    /* For server (responder): first key is for decryption, second for encryption */
    noise_hkdf(ctx->ck, NULL, 0, ctx->decrypt_key, ctx->encrypt_key, NULL);
    ctx->encrypt_nonce = 0;
    ctx->decrypt_nonce = 0;
}

/* ============================================================================
 * Initialization Functions
 * ============================================================================ */

/**
 * @brief Initialize protocol name hash
 *
 * Protocol name: "Noise_NNpsk0_25519_ChaChaPoly_SHA256"
 */
static void noise_init_symmetric_state(esphome_noise_ctx_t *ctx)
{
    static const char PROTOCOL_NAME[] = "Noise_NNpsk0_25519_ChaChaPoly_SHA256";

    /* h = HASH(protocol_name) - protocol name is > 32 bytes */
    noise_hash((const uint8_t *)PROTOCOL_NAME, strlen(PROTOCOL_NAME), ctx->h);

    /* ck = h */
    memcpy(ctx->ck, ctx->h, NOISE_HASH_SIZE);

    /* Initialize cipher state */
    memset(ctx->k, 0, NOISE_HASH_SIZE);
    ctx->n = 0;
    ctx->has_key = false;
}

