moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
esp_err_t esphome_noise_init(void)
{
#if USE_PSA_CRYPTO
    psa_status_t status = psa_crypto_init();
    if (status != PSA_SUCCESS) {
        /* PSA_ERROR_BAD_STATE (-137) = already initialized, OK
         * PSA_ERROR_ALREADY_EXISTS (-129) = also OK in some implementations */
        if (status != PSA_ERROR_BAD_STATE && status != PSA_ERROR_ALREADY_EXISTS) {
            ESP_LOGE(TAG, "psa_crypto_init failed: %d", (int)status);
            return ESP_FAIL;
        }
        ESP_LOGD(TAG, "PSA Crypto already initialized (status=%d)", (int)status);
    }
    ESP_LOGI(TAG, "Noise Protocol encryption initialized (PSA Crypto API)");
#else
    ESP_LOGI(TAG, "Noise Protocol encryption initialized (mbedTLS legacy)");
#endif
    return ESP_OK;
}

esphome_noise_ctx_t *esphome_noise_create(const char *psk_base64,
                                           const char *device_name,
                                           const char *mac_address)
{
    esphome_noise_ctx_t *ctx = mem_ng_calloc(1, sizeof(esphome_noise_ctx_t), MEM_CAP_DEFAULT);
    if (!ctx) {
        ESP_LOGE(TAG, "Failed to allocate Noise context");
        return NULL;
    }

    ctx->state = ESPHOME_NOISE_STATE_INIT;

    /* Decode PSK if provided */
    if (psk_base64 && strlen(psk_base64) > 0) {
        esp_err_t ret = esphome_noise_decode_key(psk_base64, ctx->psk);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Invalid PSK Base64 encoding");
            mem_ng_free(ctx);
            return NULL;
        }
        ctx->has_psk = true;
        ESP_LOGI(TAG, "PSK configured for Noise encryption");
    } else {
        /* No PSK - use zero key */
        memset(ctx->psk, 0, NOISE_HASH_SIZE);
        ctx->has_psk = false;
        ESP_LOGW(TAG, "No PSK configured - using empty key");
    }

    /* Copy device info */
    if (device_name) {
        strncpy(ctx->device_name, device_name, ESPHOME_NOISE_MAX_DEVICE_NAME - 1);
    }
    if (mac_address) {
        strncpy(ctx->mac_address, mac_address, ESPHOME_NOISE_MAC_STR_LEN - 1);
    }

    return ctx;
}

void esphome_noise_destroy(esphome_noise_ctx_t *ctx)
{
    if (ctx) {
        /* Securely wipe sensitive data */
        mbedtls_platform_zeroize(ctx, sizeof(esphome_noise_ctx_t));
        mem_ng_free(ctx);
    }
}

esp_err_t esphome_noise_reset(esphome_noise_ctx_t *ctx)
{
    if (!ctx) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Preserve PSK and device info, reset everything else */
    uint8_t psk_backup[NOISE_HASH_SIZE];
    bool has_psk = ctx->has_psk;
    char device_name[ESPHOME_NOISE_MAX_DEVICE_NAME];
    char mac_address[ESPHOME_NOISE_MAC_STR_LEN];

    memcpy(psk_backup, ctx->psk, NOISE_HASH_SIZE);
    strncpy(device_name, ctx->device_name, ESPHOME_NOISE_MAX_DEVICE_NAME - 1);
    device_name[ESPHOME_NOISE_MAX_DEVICE_NAME - 1] = '\0';
    strncpy(mac_address, ctx->mac_address, ESPHOME_NOISE_MAC_STR_LEN - 1);
    mac_address[ESPHOME_NOISE_MAC_STR_LEN - 1] = '\0';

    /* Clear context */
    mbedtls_platform_zeroize(ctx, sizeof(esphome_noise_ctx_t));

    /* Restore preserved data */
    memcpy(ctx->psk, psk_backup, NOISE_HASH_SIZE);
    ctx->has_psk = has_psk;
    strncpy(ctx->device_name, device_name, ESPHOME_NOISE_MAX_DEVICE_NAME - 1);
    ctx->device_name[ESPHOME_NOISE_MAX_DEVICE_NAME - 1] = '\0';
    strncpy(ctx->mac_address, mac_address, ESPHOME_NOISE_MAC_STR_LEN - 1);
    ctx->mac_address[ESPHOME_NOISE_MAC_STR_LEN - 1] = '\0';
    ctx->state = ESPHOME_NOISE_STATE_INIT;

    mbedtls_platform_zeroize(psk_backup, sizeof(psk_backup));

    return ESP_OK;
}

/* ============================================================================
 * Handshake Functions
 * ============================================================================ */

bool esphome_noise_is_hello(const uint8_t *data, size_t len)
{
    /* Noise Hello uses 0x00 indicator with varint length encoding */
    return len >= 1 && data[0] == ESPHOME_NOISE_HELLO_INDICATOR;
}

esp_err_t esphome_noise_process_hello(esphome_noise_ctx_t *ctx,
                                       const uint8_t *client_data, size_t client_len,
                                       uint8_t *response, size_t response_size,
                                       size_t *response_len)
{
    if (!ctx || !response || !response_len) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Client Hello payload may be empty or contain flags - no marker to verify */
    ESP_LOGI(TAG, "Received Noise Hello from client (%zu bytes payload)", client_len);

    /* Build SERVER_HELLO response:
     * - Byte 0: 0x01 = Noise encryption protocol selected
     * - Bytes 1+: device_name (null-terminated)
     * - Final: mac_address (null-terminated, 12 hex chars) */
    size_t name_len = strlen(ctx->device_name);
    size_t mac_len = strlen(ctx->mac_address);
    size_t total_len = 1 + name_len + 1 + mac_len + 1;

    if (total_len > response_size) {
        ESP_LOGE(TAG, "Response buffer too small for Hello");
        return ESP_ERR_NO_MEM;
    }

    size_t pos = 0;
    response[pos++] = ESPHOME_NOISE_PROTO_SELECTED;
    memcpy(response + pos, ctx->device_name, name_len);
    pos += name_len;
    response[pos++] = '\0';
    memcpy(response + pos, ctx->mac_address, mac_len);
    pos += mac_len;
    response[pos++] = '\0';

    *response_len = pos;
    ctx->state = ESPHOME_NOISE_STATE_HELLO_SENT;

    ESP_LOGI(TAG, "Sent Hello response: device='%s', mac='%s'",
             ctx->device_name, ctx->mac_address);

    return ESP_OK;
}

esp_err_t esphome_noise_process_handshake(esphome_noise_ctx_t *ctx,
                                           const uint8_t *handshake_data, size_t handshake_len,
                                           uint8_t *response, size_t response_size,
                                           size_t *response_len)
{
    if (!ctx || !handshake_data || !response || !response_len) {
        return ESP_ERR_INVALID_ARG;
    }

    ESP_LOGI(TAG, "Processing handshake message (%zu bytes)", handshake_len);

    /*
     * NN Pattern (responder):
     *   <- e
     *   -> e, ee
     *
     * With psk0:
     *   <- psk, e
     *   -> e, ee
     */

    /* Initialize symmetric state */
    noise_init_symmetric_state(ctx);

    /* MixHash(prologue) */
    noise_mix_hash(ctx, (const uint8_t *)ESPHOME_NOISE_PROLOGUE, ESPHOME_NOISE_PROLOGUE_LEN);

