moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
    /* PSK0: MixKeyAndHash(psk) before processing 'e' */
    noise_mix_key_and_hash(ctx, ctx->psk, 32);

    /* Client handshake format:
     * [0x00 preamble][32B ephemeral key][encrypted payload + 16B MAC]
     * Preamble: 0x00 = handshake message, non-zero = error from client
     * Minimum: 1 (preamble) + 32 (ephemeral) + 16 (MAC) = 49 bytes */
    const size_t PREAMBLE_SIZE = 1;
    const size_t EPHEMERAL_SIZE = 32;
    const size_t MIN_HANDSHAKE_SIZE = PREAMBLE_SIZE + EPHEMERAL_SIZE + ESPHOME_NOISE_MAC_SIZE;

    if (handshake_len < MIN_HANDSHAKE_SIZE) {
        ESP_LOGE(TAG, "Handshake too short: need %zu bytes, got %zu",
                 MIN_HANDSHAKE_SIZE, handshake_len);
        goto error;
    }

    /* Check preamble: 0x00 = handshake message, non-zero = error from client */
    if (handshake_data[0] != ESPHOME_NOISE_HANDSHAKE_OK) {
        ESP_LOGE(TAG, "Invalid handshake preamble: 0x%02x (expected 0x%02x)",
                 handshake_data[0], ESPHOME_NOISE_HANDSHAKE_OK);
        goto error;
    }

    /* Read client ephemeral public key (re) - starts after preamble byte */
    const size_t key_offset = PREAMBLE_SIZE;
    const size_t encrypted_offset = PREAMBLE_SIZE + EPHEMERAL_SIZE;

    memcpy(ctx->re, handshake_data + key_offset, EPHEMERAL_SIZE);

    /* MixHash(re) */
    noise_mix_hash(ctx, ctx->re, EPHEMERAL_SIZE);

    /* MixKey(re) - required after MixHash(re) because PSK set has_key=true */
    noise_mix_key(ctx, ctx->re, EPHEMERAL_SIZE);

    /* Decrypt payload (encrypted empty payload + MAC) */
    if (handshake_len > encrypted_offset) {
        size_t encrypted_len = handshake_len - encrypted_offset;
        uint8_t *decrypted = mem_alloc(encrypted_len, MEM_CAP_DEFAULT);
        if (!decrypted) {
            ESP_LOGE(TAG, "Failed to allocate decrypt buffer");
            goto error;
        }

        size_t decrypted_len;
        esp_err_t ret = noise_decrypt_and_hash(ctx, handshake_data + encrypted_offset,
                                                encrypted_len, decrypted, &decrypted_len);
        mem_ng_free(decrypted);

        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to decrypt handshake payload");
            goto error;
        }
    }

    /* Generate server ephemeral keypair */
    x25519_keypair(ctx->e_public, ctx->e_private);

    /* === Build response === */
    /* Response format: [0x00 success][32B ephemeral][encrypted empty payload + 16B MAC] */

    if (response_size < 1 + 32 + 16) {
        ESP_LOGE(TAG, "Response buffer too small");
        goto error;
    }

    size_t pos = 0;

    /* Success marker */
    response[pos++] = ESPHOME_NOISE_HANDSHAKE_OK;

    /* Write server ephemeral (e) */
    memcpy(response + pos, ctx->e_public, 32);
    pos += 32;

    /* MixHash(e) */
    noise_mix_hash(ctx, ctx->e_public, 32);

    /* ESPHome-specific: MixKey(e) after MixHash(e) */
    noise_mix_key(ctx, ctx->e_public, 32);

    /* Compute DH: ee = DH(e, re) */
    uint8_t shared_secret[32];
    x25519_shared_secret(shared_secret, ctx->e_private, ctx->re);

    /* MixKey(ee) */
    noise_mix_key(ctx, shared_secret, 32);
    mbedtls_platform_zeroize(shared_secret, sizeof(shared_secret));

    /* Encrypt empty payload (just produces MAC) */
    esp_err_t ret = noise_encrypt_and_hash(ctx, NULL, 0, response + pos);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to encrypt handshake response");
        goto error;
    }
    pos += 16;  /* Just MAC, no plaintext */

    *response_len = pos;

    /* Split to derive transport keys */
    noise_split(ctx);

    ctx->state = ESPHOME_NOISE_STATE_READY;
    ESP_LOGI(TAG, "Noise handshake complete - encryption ready");

    return ESP_OK;

error:
    /* Send error response */
    if (response_size >= NOISE_HANDSHAKE_MIN_RESPONSE_SIZE) {
        response[0] = 0x01;  /* Error marker */
        const char *err_msg = "Handshake failed";
        size_t err_len = strlen(err_msg);
        memcpy(response + 1, err_msg, err_len);
        *response_len = 1 + err_len;
    } else {
        *response_len = 0;
    }
    ctx->state = ESPHOME_NOISE_STATE_ERROR;
    return ESP_FAIL;
}

/* ============================================================================
 * Transport Functions
 * ============================================================================ */

esp_err_t esphome_noise_encrypt(esphome_noise_ctx_t *ctx,
                                 uint16_t msg_type,
                                 const uint8_t *payload, size_t payload_len,
                                 uint8_t *output, size_t output_size,
                                 size_t *output_len)
{
    if (!ctx || !output || !output_len) {
        return ESP_ERR_INVALID_ARG;
    }

    if (ctx->state != ESPHOME_NOISE_STATE_READY) {
        ESP_LOGE(TAG, "Cannot encrypt: not in READY state (state=%d)", ctx->state);
        return ESP_ERR_INVALID_STATE;
    }

    /* Inner frame: [2B msg_type BE][2B payload_len BE][payload] */
    size_t inner_len = 4 + payload_len;

    /* What has to fit in the frame's 16-bit length field is the *ciphertext*,
     * which is the inner frame plus the 16-byte MAC — not the inner frame
     * alone. Comparing inner_len against the full 65535 left a window where
     * inner_len is accepted but inner_len + 16 wraps, and the header would
     * then advertise a handful of bytes while the body carried 64K. No caller
     * can reach it today (esphome_api_server caps messages at
     * ESPHOME_MAX_MESSAGE_SIZE, 4096), so this is the contract being made
     * honest rather than a live defect. */
    if (inner_len > ESPHOME_NOISE_MAX_PAYLOAD - ESPHOME_NOISE_MAC_SIZE) {
        ESP_LOGE(TAG, "Payload too large: %zu > %d", inner_len,
                 ESPHOME_NOISE_MAX_PAYLOAD - ESPHOME_NOISE_MAC_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }

    /* Output: [0x01 indicator][2B encrypted_len BE][encrypted inner + 16B MAC] */
    size_t encrypted_len = inner_len + ESPHOME_NOISE_MAC_SIZE;
    size_t total_output = ESPHOME_NOISE_FRAME_HEADER_SIZE + encrypted_len;

