moag1000/ESP32-c5-Zigbee2ESPHome/main/esphome/esphome_noise.c
    if (total_output > output_size) {
        ESP_LOGE(TAG, "Output buffer too small: need %zu, have %zu", total_output, output_size);
        return ESP_ERR_NO_MEM;
    }

    /* Build inner frame */
    uint8_t *inner = mem_alloc(inner_len, MEM_CAP_DEFAULT);
    if (!inner) {
        return ESP_ERR_NO_MEM;
    }

    inner[0] = (msg_type >> 8) & 0xFF;   /* Big-endian msg_type */
    inner[1] = msg_type & 0xFF;
    inner[2] = (payload_len >> 8) & 0xFF;  /* Big-endian payload_len */
    inner[3] = payload_len & 0xFF;
    if (payload && payload_len > 0) {
        memcpy(inner + 4, payload, payload_len);
    }

    /* Write Noise frame header: [0x01 indicator][2B length BE] */
    output[0] = ESPHOME_FRAME_NOISE;
    output[1] = (encrypted_len >> 8) & 0xFF;
    output[2] = encrypted_len & 0xFF;

    /* Encrypt inner frame */
    uint8_t tag[ESPHOME_NOISE_MAC_SIZE];
    esp_err_t ret = noise_encrypt_aead(ctx->encrypt_key, ctx->encrypt_nonce,
                                        NULL, 0,  /* No AAD for transport */
                                        inner, inner_len,
                                        output + ESPHOME_NOISE_FRAME_HEADER_SIZE, tag);
    mem_ng_free(inner);

    if (ret != ESP_OK) {
        return ret;
    }

    /* Append MAC */
    memcpy(output + ESPHOME_NOISE_FRAME_HEADER_SIZE + inner_len, tag,
           ESPHOME_NOISE_MAC_SIZE);

    ctx->encrypt_nonce++;
    *output_len = total_output;

    return ESP_OK;
}

esp_err_t esphome_noise_decrypt(esphome_noise_ctx_t *ctx,
                                 const uint8_t *ciphertext, size_t ciphertext_len,
                                 uint16_t *msg_type,
                                 uint8_t *payload, size_t payload_size,
                                 size_t *payload_len)
{
    if (!ctx || !ciphertext || !msg_type || !payload || !payload_len) {
        return ESP_ERR_INVALID_ARG;
    }

    if (ctx->state != ESPHOME_NOISE_STATE_READY) {
        ESP_LOGE(TAG, "Cannot decrypt: not in READY state (state=%d)", ctx->state);
        return ESP_ERR_INVALID_STATE;
    }

    /* Ciphertext format: encrypted([2B msg_type BE][2B payload_len BE][payload]) + 16B MAC */
    if (ciphertext_len < ESPHOME_NOISE_MAC_SIZE + 4) {
        ESP_LOGE(TAG, "Ciphertext too short: %zu", ciphertext_len);
        return ESP_ERR_INVALID_SIZE;
    }

    size_t data_len = ciphertext_len - ESPHOME_NOISE_MAC_SIZE;
    const uint8_t *tag = ciphertext + data_len;

    /* Allocate buffer for decrypted inner frame */
    uint8_t *inner = mem_alloc(data_len, MEM_CAP_DEFAULT);
    if (!inner) {
        return ESP_ERR_NO_MEM;
    }

    /* Decrypt */
    esp_err_t ret = noise_decrypt_aead(ctx->decrypt_key, ctx->decrypt_nonce,
                                        NULL, 0,  /* No AAD for transport */
                                        ciphertext, data_len,
                                        tag, inner);
    if (ret != ESP_OK) {
        mem_ng_free(inner);
        ESP_LOGE(TAG, "Decryption failed - MAC mismatch");
        return ret;
    }

    ctx->decrypt_nonce++;

    /* Parse inner frame */
    if (data_len < 4) {
        mem_ng_free(inner);
        ESP_LOGE(TAG, "Decrypted data too short for header");
        return ESP_ERR_INVALID_SIZE;
    }

    *msg_type = (inner[0] << 8) | inner[1];
    uint16_t inner_payload_len = (inner[2] << 8) | inner[3];

    if (inner_payload_len + 4 > data_len) {
        mem_ng_free(inner);
        ESP_LOGE(TAG, "Invalid payload length in decrypted frame");
        return ESP_ERR_INVALID_SIZE;
    }

    if (inner_payload_len > payload_size) {
        mem_ng_free(inner);
        ESP_LOGE(TAG, "Payload buffer too small: need %u, have %zu",
                 inner_payload_len, payload_size);
        return ESP_ERR_NO_MEM;
    }

    if (inner_payload_len > 0) {
        memcpy(payload, inner + 4, inner_payload_len);
    }
    *payload_len = inner_payload_len;

    mem_ng_free(inner);
    return ESP_OK;
}

/* ============================================================================
 * State Query Functions
 * ============================================================================ */

esphome_noise_state_t esphome_noise_get_state(const esphome_noise_ctx_t *ctx)
{
    return ctx ? ctx->state : ESPHOME_NOISE_STATE_ERROR;
}

bool esphome_noise_is_ready(const esphome_noise_ctx_t *ctx)
{
    return ctx && ctx->state == ESPHOME_NOISE_STATE_READY;
}

const char *esphome_noise_state_name(esphome_noise_state_t state)
{
    switch (state) {
        case ESPHOME_NOISE_STATE_INIT:           return "INIT";
        case ESPHOME_NOISE_STATE_HELLO_WAIT:     return "HELLO_WAIT";
        case ESPHOME_NOISE_STATE_HELLO_SENT:     return "HELLO_SENT";
        case ESPHOME_NOISE_STATE_HANDSHAKE_WAIT: return "HANDSHAKE_WAIT";
        case ESPHOME_NOISE_STATE_HANDSHAKE_DONE: return "HANDSHAKE_DONE";
        case ESPHOME_NOISE_STATE_READY:          return "READY";
        case ESPHOME_NOISE_STATE_ERROR:          return "ERROR";
        default:                                  return "UNKNOWN";
    }
}

/* ============================================================================
 * Utility Functions
 * ============================================================================ */

esp_err_t esphome_noise_decode_key(const char *base64_key, uint8_t *key_out)
{
    if (!base64_key || !key_out) {
        return ESP_ERR_INVALID_ARG;
    }

    size_t olen;
    int ret = mbedtls_base64_decode(key_out, 32, &olen,
                                     (const unsigned char *)base64_key,
                                     strlen(base64_key));
    if (ret != 0 || olen != 32) {
        ESP_LOGE(TAG, "Invalid Base64 key: ret=%d, len=%zu", ret, olen);
        return ESP_ERR_INVALID_ARG;
    }

    return ESP_OK;
}

esp_err_t esphome_noise_generate_key(char *base64_out, size_t base64_size)
{
    /* 32 bytes -> 44 base64 chars + null */
    if (!base64_out || base64_size < NOISE_BASE64_ENCODED_MIN_SIZE) {
        return ESP_ERR_INVALID_ARG;
    }

    /* Generate 32 random bytes */
    uint8_t key[NOISE_DH_OUTPUT_SIZE];
    esp_fill_random(key, NOISE_DH_OUTPUT_SIZE);

    /* Encode to Base64 */
    size_t olen;
    int ret = mbedtls_base64_encode((unsigned char *)base64_out, base64_size, &olen,
                                     key, NOISE_DH_OUTPUT_SIZE);

    mbedtls_platform_zeroize(key, sizeof(key));

    if (ret != 0) {
        ESP_LOGE(TAG, "Base64 encode failed: %d", ret);
        return ESP_FAIL;
    }

    base64_out[olen] = '\0';
    return ESP_OK;
}
